TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_lcd.h
/* LCD_LCDBLKCTL Bits */
/* LCD_LCDBLKCTL[LCDBLKMODX] Bits */
#define LCD_LCDBLKCTL_LCDBLKMODX_OFS             (0)                             /* !< LCDBLKMODX Offset */
#define LCD_LCDBLKCTL_LCDBLKMODX_MASK            ((uint32_t)0x00000003U)         /* !< Blinking mode 00b = Blinking
                                                                                    disabled.  01b = Blinking of
                                                                                    individual segments as enabled in
                                                                                    blinking memory register LCDBMx. In
                                                                                    mux mode >5 blinking is disabled.
                                                                                    10b = Blinking of all segments 11b =
                                                                                    Switching between display contents as
                                                                                    stored in LCDMx and LCDBMx memory
                                                                                    registers. In mux mode >5 blinking is
                                                                                    disabled. */
#define LCD_LCDBLKCTL_LCDBLKMODX_BLINK_DISABLE   ((uint32_t)0x00000000U)         /* !< Blinking disabled. */
#define LCD_LCDBLKCTL_LCDBLKMODX_BLINK_SELECED   ((uint32_t)0x00000001U)         /* !< Blinking of individual segments as
                                                                                    enabled in blinking memory register
                                                                                    LCDBMx. In mux mode >5 blinking is
                                                                                    disabled. */
#define LCD_LCDBLKCTL_LCDBLKMODX_BLINK_ALL       ((uint32_t)0x00000002U)         /* !< Blinking of all segments */
#define LCD_LCDBLKCTL_LCDBLKMODX_BKINK_TOGGLE    ((uint32_t)0x00000003U)         /* !< Switching between display contents
                                                                                    as stored in LCDMx and LCDBMx memory
                                                                                    registers. In mux mode >5 blinking is
                                                                                    disabled. */
/* LCD_LCDBLKCTL[LCDBLKPREX] Bits */
#define LCD_LCDBLKCTL_LCDBLKPREX_OFS             (2)                             /* !< LCDBLKPREX Offset */
#define LCD_LCDBLKCTL_LCDBLKPREX_MASK            ((uint32_t)0x0000001CU)         /* !< Clock prescaler for blinking
                                                                                    frequency. */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_2        ((uint32_t)0x00000000U)         /* !< Divide by 2 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_4        ((uint32_t)0x00000004U)         /* !< Divide by 4 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_8        ((uint32_t)0x00000008U)         /* !< Divide by 8 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_16       ((uint32_t)0x0000000CU)         /* !< Divide by 16 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_32       ((uint32_t)0x00000010U)         /* !< Divide by 32 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_64       ((uint32_t)0x00000014U)         /* !< Divide by 64 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_128      ((uint32_t)0x00000018U)         /* !< Divide by 128 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_256      ((uint32_t)0x0000001CU)         /* !< Divide by 256 */

/* LCD_LCDMEMCTL Bits */
/* LCD_LCDMEMCTL[LCDCLRBM] Bits */
#define LCD_LCDMEMCTL_LCDCLRBM_OFS               (2)                             /* !< LCDCLRBM Offset */
#define LCD_LCDMEMCTL_LCDCLRBM_MASK              ((uint32_t)0x00000004U)         /* !< Clear LCD blinking memory Clears
                                                                                    all blinking memory registers LCDBMx.
                                                                                    The bit is automatically reset when
                                                                                    the blinking memory is cleared.
                                                                                    Setting this bit in 5-mux mode and
                                                                                    above has no effect. It is
                                                                                    immediately reset again.  0b =
                                                                                    Contents of blinking memory registers
                                                                                    LCDBMx remain unchanged 1b = Clear
                                                                                    content of all blinking memory
                                                                                    registers LCDBMx */
#define LCD_LCDMEMCTL_LCDCLRBM_NO_CLR_BLNK_MEM_REGS ((uint32_t)0x00000000U)         /* !< Contents of blinking memory
                                                                                    registers LCDBMx remain unchanged */
#define LCD_LCDMEMCTL_LCDCLRBM_CLR_BLNK_MEM_REGS ((uint32_t)0x00000004U)         /* !< Clear content of all blinking
                                                                                    memory registers LCDBMx */
/* LCD_LCDMEMCTL[LCDCLRM] Bits */
#define LCD_LCDMEMCTL_LCDCLRM_OFS                (1)                             /* !< LCDCLRM Offset */
#define LCD_LCDMEMCTL_LCDCLRM_MASK               ((uint32_t)0x00000002U)         /* !< Clear LCD memory Clears all LCD
                                                                                    memory registers LCDMx. The bit is
                                                                                    automatically reset when the LCD
                                                                                    memory is cleared.  0b = Contents of
                                                                                    LCD memory registers LCDMx remain
                                                                                    unchanged 1b = Clear content of all
                                                                                    LCD memory registers LCDMx */
#define LCD_LCDMEMCTL_LCDCLRM_NO_CLR_LCD_MEM_REGS ((uint32_t)0x00000000U)         /* !< Contents of LCD memory registers
                                                                                    LCDMx remain unchanged */
#define LCD_LCDMEMCTL_LCDCLRM_CLR_LCD_MEM_REGS   ((uint32_t)0x00000002U)         /* !< Clear content of all LCD memory
                                                                                    registers LCDMx */
/* LCD_LCDMEMCTL[LCDDISP] Bits */
#define LCD_LCDMEMCTL_LCDDISP_OFS                (0)                             /* !< LCDDISP Offset */
#define LCD_LCDMEMCTL_LCDDISP_MASK               ((uint32_t)0x00000001U)         /* !< Select LCD memory registers for
                                                                                    display When LCDBLKMODx = 00, LCDDISP
                                                                                    can be set by software.  The bit is
                                                                                    cleared in LCDBLKMODx = 01 and
                                                                                    LCDBLKMODx = 10 or if a mux mode =5
                                                                                    is selected and cannot be changed by
                                                                                    software.  When LCDBLKMODx = 11, this
                                                                                    bit reflects the currently displayed
                                                                                    memory but cannot be changed by
                                                                                    software. When returning to
                                                                                    LCDBLKMODx = 00 the bit is cleared.
                                                                                    0b = Display content of LCD memory
                                                                                    registers LCDMx 1b = Display content
                                                                                    of LCD blinking memory registers
                                                                                    LCDBMx */
#define LCD_LCDMEMCTL_LCDDISP_SEL_LCD_MEM_REGS   ((uint32_t)0x00000000U)         /* !< Display content of LCD memory
                                                                                    registers LCDMx */
#define LCD_LCDMEMCTL_LCDDISP_SEL_BLNK_MEM_REGS  ((uint32_t)0x00000001U)         /* !< Display content of LCD blinking
                                                                                    memory registers LCDBMx */

