TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_lcd.h
/* LCD_LCDPCTL2 Bits */
/* LCD_LCDPCTL2[LCDS32] Bits */
#define LCD_LCDPCTL2_LCDS32_OFS                  (0)                             /* !< LCDS32 Offset */
#define LCD_LCDPCTL2_LCDS32_MASK                 ((uint32_t)0x00000001U)         /* !< LCD pin 32 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS32_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS32_SEL_LCD              ((uint32_t)0x00000001U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS33] Bits */
#define LCD_LCDPCTL2_LCDS33_OFS                  (1)                             /* !< LCDS33 Offset */
#define LCD_LCDPCTL2_LCDS33_MASK                 ((uint32_t)0x00000002U)         /* !< LCD pin 33 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS33_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS33_SEL_LCD              ((uint32_t)0x00000002U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS34] Bits */
#define LCD_LCDPCTL2_LCDS34_OFS                  (2)                             /* !< LCDS34 Offset */
#define LCD_LCDPCTL2_LCDS34_MASK                 ((uint32_t)0x00000004U)         /* !< LCD pin 34 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS34_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS34_SEL_LCD              ((uint32_t)0x00000004U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS35] Bits */
#define LCD_LCDPCTL2_LCDS35_OFS                  (3)                             /* !< LCDS35 Offset */
#define LCD_LCDPCTL2_LCDS35_MASK                 ((uint32_t)0x00000008U)         /* !< LCD pin 35 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS35_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS35_SEL_LCD              ((uint32_t)0x00000008U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS36] Bits */
#define LCD_LCDPCTL2_LCDS36_OFS                  (4)                             /* !< LCDS36 Offset */
#define LCD_LCDPCTL2_LCDS36_MASK                 ((uint32_t)0x00000010U)         /* !< LCD pin 36 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS36_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS36_SEL_LCD              ((uint32_t)0x00000010U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS37] Bits */
#define LCD_LCDPCTL2_LCDS37_OFS                  (5)                             /* !< LCDS37 Offset */
#define LCD_LCDPCTL2_LCDS37_MASK                 ((uint32_t)0x00000020U)         /* !< LCD pin 37 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS37_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS37_SEL_LCD              ((uint32_t)0x00000020U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS38] Bits */
#define LCD_LCDPCTL2_LCDS38_OFS                  (6)                             /* !< LCDS38 Offset */
#define LCD_LCDPCTL2_LCDS38_MASK                 ((uint32_t)0x00000040U)         /* !< LCD pin 38 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS38_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS38_SEL_LCD              ((uint32_t)0x00000040U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS39] Bits */
#define LCD_LCDPCTL2_LCDS39_OFS                  (7)                             /* !< LCDS39 Offset */
#define LCD_LCDPCTL2_LCDS39_MASK                 ((uint32_t)0x00000080U)         /* !< LCD pin 39 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS39_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS39_SEL_LCD              ((uint32_t)0x00000080U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS40] Bits */
#define LCD_LCDPCTL2_LCDS40_OFS                  (8)                             /* !< LCDS40 Offset */
#define LCD_LCDPCTL2_LCDS40_MASK                 ((uint32_t)0x00000100U)         /* !< LCD pin 40 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS40_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS40_SEL_LCD              ((uint32_t)0x00000100U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS41] Bits */
#define LCD_LCDPCTL2_LCDS41_OFS                  (9)                             /* !< LCDS41 Offset */
#define LCD_LCDPCTL2_LCDS41_MASK                 ((uint32_t)0x00000200U)         /* !< LCD pin 41 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS41_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS41_SEL_LCD              ((uint32_t)0x00000200U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS42] Bits */
#define LCD_LCDPCTL2_LCDS42_OFS                  (10)                            /* !< LCDS42 Offset */
#define LCD_LCDPCTL2_LCDS42_MASK                 ((uint32_t)0x00000400U)         /* !< LCD pin 42 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS42_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS42_SEL_LCD              ((uint32_t)0x00000400U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS43] Bits */
#define LCD_LCDPCTL2_LCDS43_OFS                  (11)                            /* !< LCDS43 Offset */
#define LCD_LCDPCTL2_LCDS43_MASK                 ((uint32_t)0x00000800U)         /* !< LCD pin 43 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS43_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS43_SEL_LCD              ((uint32_t)0x00000800U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS44] Bits */
#define LCD_LCDPCTL2_LCDS44_OFS                  (12)                            /* !< LCDS44 Offset */
#define LCD_LCDPCTL2_LCDS44_MASK                 ((uint32_t)0x00001000U)         /* !< LCD pin 44 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS44_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS44_SEL_LCD              ((uint32_t)0x00001000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS45] Bits */
#define LCD_LCDPCTL2_LCDS45_OFS                  (13)                            /* !< LCDS45 Offset */
#define LCD_LCDPCTL2_LCDS45_MASK                 ((uint32_t)0x00002000U)         /* !< LCD pin 45 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS45_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS45_SEL_LCD              ((uint32_t)0x00002000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS46] Bits */
#define LCD_LCDPCTL2_LCDS46_OFS                  (14)                            /* !< LCDS46 Offset */
#define LCD_LCDPCTL2_LCDS46_MASK                 ((uint32_t)0x00004000U)         /* !< LCD pin 46 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS46_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS46_SEL_LCD              ((uint32_t)0x00004000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL2[LCDS47] Bits */
#define LCD_LCDPCTL2_LCDS47_OFS                  (15)                            /* !< LCDS47 Offset */
#define LCD_LCDPCTL2_LCDS47_MASK                 ((uint32_t)0x00008000U)         /* !< LCD pin 47 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS47_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL2_LCDS47_SEL_LCD              ((uint32_t)0x00008000U)         /* !< Pins are LCD functions. */

