TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_lcd.h
/* LCD_LCDCSSEL2 Bits */
/* LCD_LCDCSSEL2[LCDCSS32] Bits */
#define LCD_LCDCSSEL2_LCDCSS32_OFS               (0)                             /* !< LCDCSS32 Offset */
#define LCD_LCDCSSEL2_LCDCSS32_MASK              ((uint32_t)0x00000001U)         /* !< Selects pin L32 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS32_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS32_SEL_COM           ((uint32_t)0x00000001U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS33] Bits */
#define LCD_LCDCSSEL2_LCDCSS33_OFS               (1)                             /* !< LCDCSS33 Offset */
#define LCD_LCDCSSEL2_LCDCSS33_MASK              ((uint32_t)0x00000002U)         /* !< Selects pin L33 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS33_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS33_SEL_COM           ((uint32_t)0x00000002U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS34] Bits */
#define LCD_LCDCSSEL2_LCDCSS34_OFS               (2)                             /* !< LCDCSS34 Offset */
#define LCD_LCDCSSEL2_LCDCSS34_MASK              ((uint32_t)0x00000004U)         /* !< Selects pin L34 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS34_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS34_SEL_COM           ((uint32_t)0x00000004U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS35] Bits */
#define LCD_LCDCSSEL2_LCDCSS35_OFS               (3)                             /* !< LCDCSS35 Offset */
#define LCD_LCDCSSEL2_LCDCSS35_MASK              ((uint32_t)0x00000008U)         /* !< Selects pin L35 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS35_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS35_SEL_COM           ((uint32_t)0x00000008U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS36] Bits */
#define LCD_LCDCSSEL2_LCDCSS36_OFS               (4)                             /* !< LCDCSS36 Offset */
#define LCD_LCDCSSEL2_LCDCSS36_MASK              ((uint32_t)0x00000010U)         /* !< Selects pin L36 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS36_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS36_SEL_COM           ((uint32_t)0x00000010U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS37] Bits */
#define LCD_LCDCSSEL2_LCDCSS37_OFS               (5)                             /* !< LCDCSS37 Offset */
#define LCD_LCDCSSEL2_LCDCSS37_MASK              ((uint32_t)0x00000020U)         /* !< Selects pin L37 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS37_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS37_SEL_COM           ((uint32_t)0x00000020U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS38] Bits */
#define LCD_LCDCSSEL2_LCDCSS38_OFS               (6)                             /* !< LCDCSS38 Offset */
#define LCD_LCDCSSEL2_LCDCSS38_MASK              ((uint32_t)0x00000040U)         /* !< Selects pin L38 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS38_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS38_SEL_COM           ((uint32_t)0x00000040U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS39] Bits */
#define LCD_LCDCSSEL2_LCDCSS39_OFS               (7)                             /* !< LCDCSS39 Offset */
#define LCD_LCDCSSEL2_LCDCSS39_MASK              ((uint32_t)0x00000080U)         /* !< Selects pin L39 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS39_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS39_SEL_COM           ((uint32_t)0x00000080U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS40] Bits */
#define LCD_LCDCSSEL2_LCDCSS40_OFS               (8)                             /* !< LCDCSS40 Offset */
#define LCD_LCDCSSEL2_LCDCSS40_MASK              ((uint32_t)0x00000100U)         /* !< Selects pin L40 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS40_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS40_SEL_COM           ((uint32_t)0x00000100U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS41] Bits */
#define LCD_LCDCSSEL2_LCDCSS41_OFS               (9)                             /* !< LCDCSS41 Offset */
#define LCD_LCDCSSEL2_LCDCSS41_MASK              ((uint32_t)0x00000200U)         /* !< Selects pin L41 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS41_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS41_SEL_COM           ((uint32_t)0x00000200U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS42] Bits */
#define LCD_LCDCSSEL2_LCDCSS42_OFS               (10)                            /* !< LCDCSS42 Offset */
#define LCD_LCDCSSEL2_LCDCSS42_MASK              ((uint32_t)0x00000400U)         /* !< Selects pin L42 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS42_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS42_SEL_COM           ((uint32_t)0x00000400U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS43] Bits */
#define LCD_LCDCSSEL2_LCDCSS43_OFS               (11)                            /* !< LCDCSS43 Offset */
#define LCD_LCDCSSEL2_LCDCSS43_MASK              ((uint32_t)0x00000800U)         /* !< Selects pin L43 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS43_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS43_SEL_COM           ((uint32_t)0x00000800U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS44] Bits */
#define LCD_LCDCSSEL2_LCDCSS44_OFS               (12)                            /* !< LCDCSS44 Offset */
#define LCD_LCDCSSEL2_LCDCSS44_MASK              ((uint32_t)0x00001000U)         /* !< Selects pin L44 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS44_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS44_SEL_COM           ((uint32_t)0x00001000U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS45] Bits */
#define LCD_LCDCSSEL2_LCDCSS45_OFS               (13)                            /* !< LCDCSS45 Offset */
#define LCD_LCDCSSEL2_LCDCSS45_MASK              ((uint32_t)0x00002000U)         /* !< Selects pin L45 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS45_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS45_SEL_COM           ((uint32_t)0x00002000U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS46] Bits */
#define LCD_LCDCSSEL2_LCDCSS46_OFS               (14)                            /* !< LCDCSS46 Offset */
#define LCD_LCDCSSEL2_LCDCSS46_MASK              ((uint32_t)0x00004000U)         /* !< Selects pin L46 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS46_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS46_SEL_COM           ((uint32_t)0x00004000U)         /* !< Common line */
/* LCD_LCDCSSEL2[LCDCSS47] Bits */
#define LCD_LCDCSSEL2_LCDCSS47_OFS               (15)                            /* !< LCDCSS47 Offset */
#define LCD_LCDCSSEL2_LCDCSS47_MASK              ((uint32_t)0x00008000U)         /* !< Selects pin L47 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL2_LCDCSS47_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL2_LCDCSS47_SEL_COM           ((uint32_t)0x00008000U)         /* !< Common line */

/* LCD_LCDCSSEL3 Bits */
/* LCD_LCDCSSEL3[LCDCSS48] Bits */
#define LCD_LCDCSSEL3_LCDCSS48_OFS               (0)                             /* !< LCDCSS48 Offset */
#define LCD_LCDCSSEL3_LCDCSS48_MASK              ((uint32_t)0x00000001U)         /* !< Selects pin L48 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS48_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS48_SEL_COM           ((uint32_t)0x00000001U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS49] Bits */
#define LCD_LCDCSSEL3_LCDCSS49_OFS               (1)                             /* !< LCDCSS49 Offset */
#define LCD_LCDCSSEL3_LCDCSS49_MASK              ((uint32_t)0x00000002U)         /* !< Selects pin L49 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS49_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS49_SEL_COM           ((uint32_t)0x00000002U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS50] Bits */
#define LCD_LCDCSSEL3_LCDCSS50_OFS               (2)                             /* !< LCDCSS50 Offset */
#define LCD_LCDCSSEL3_LCDCSS50_MASK              ((uint32_t)0x00000004U)         /* !< Selects pin L50 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS50_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS50_SEL_COM           ((uint32_t)0x00000004U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS51] Bits */
#define LCD_LCDCSSEL3_LCDCSS51_OFS               (3)                             /* !< LCDCSS51 Offset */
#define LCD_LCDCSSEL3_LCDCSS51_MASK              ((uint32_t)0x00000008U)         /* !< Selects pin L51 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS51_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS51_SEL_COM           ((uint32_t)0x00000008U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS52] Bits */
#define LCD_LCDCSSEL3_LCDCSS52_OFS               (4)                             /* !< LCDCSS52 Offset */
#define LCD_LCDCSSEL3_LCDCSS52_MASK              ((uint32_t)0x00000010U)         /* !< Selects pin L52 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS52_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS52_SEL_COM           ((uint32_t)0x00000010U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS53] Bits */
#define LCD_LCDCSSEL3_LCDCSS53_OFS               (5)                             /* !< LCDCSS53 Offset */
#define LCD_LCDCSSEL3_LCDCSS53_MASK              ((uint32_t)0x00000020U)         /* !< Selects pin L53 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS53_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS53_SEL_COM           ((uint32_t)0x00000020U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS54] Bits */
#define LCD_LCDCSSEL3_LCDCSS54_OFS               (6)                             /* !< LCDCSS54 Offset */
#define LCD_LCDCSSEL3_LCDCSS54_MASK              ((uint32_t)0x00000040U)         /* !< Selects pin L54 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS54_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS54_SEL_COM           ((uint32_t)0x00000040U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS55] Bits */
#define LCD_LCDCSSEL3_LCDCSS55_OFS               (7)                             /* !< LCDCSS55 Offset */
#define LCD_LCDCSSEL3_LCDCSS55_MASK              ((uint32_t)0x00000080U)         /* !< Selects pin L55 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS55_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS55_SEL_COM           ((uint32_t)0x00000080U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS56] Bits */
#define LCD_LCDCSSEL3_LCDCSS56_OFS               (8)                             /* !< LCDCSS56 Offset */
#define LCD_LCDCSSEL3_LCDCSS56_MASK              ((uint32_t)0x00000100U)         /* !< Selects pin L56 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS56_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS56_SEL_COM           ((uint32_t)0x00000100U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS57] Bits */
#define LCD_LCDCSSEL3_LCDCSS57_OFS               (9)                             /* !< LCDCSS57 Offset */
#define LCD_LCDCSSEL3_LCDCSS57_MASK              ((uint32_t)0x00000200U)         /* !< Selects pin L57 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS57_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS57_SEL_COM           ((uint32_t)0x00000200U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS58] Bits */
#define LCD_LCDCSSEL3_LCDCSS58_OFS               (10)                            /* !< LCDCSS58 Offset */
#define LCD_LCDCSSEL3_LCDCSS58_MASK              ((uint32_t)0x00000400U)         /* !< Selects pin L58 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS58_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS58_SEL_COM           ((uint32_t)0x00000400U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS59] Bits */
#define LCD_LCDCSSEL3_LCDCSS59_OFS               (11)                            /* !< LCDCSS59 Offset */
#define LCD_LCDCSSEL3_LCDCSS59_MASK              ((uint32_t)0x00000800U)         /* !< Selects pin L59 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS59_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS59_SEL_COM           ((uint32_t)0x00000800U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS60] Bits */
#define LCD_LCDCSSEL3_LCDCSS60_OFS               (12)                            /* !< LCDCSS60 Offset */
#define LCD_LCDCSSEL3_LCDCSS60_MASK              ((uint32_t)0x00001000U)         /* !< Selects pin L60 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS60_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS60_SEL_COM           ((uint32_t)0x00001000U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS61] Bits */
#define LCD_LCDCSSEL3_LCDCSS61_OFS               (13)                            /* !< LCDCSS61 Offset */
#define LCD_LCDCSSEL3_LCDCSS61_MASK              ((uint32_t)0x00002000U)         /* !< Selects pin L61 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS61_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS61_SEL_COM           ((uint32_t)0x00002000U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS62] Bits */
#define LCD_LCDCSSEL3_LCDCSS62_OFS               (14)                            /* !< LCDCSS62 Offset */
#define LCD_LCDCSSEL3_LCDCSS62_MASK              ((uint32_t)0x00004000U)         /* !< Selects pin L62 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS62_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS62_SEL_COM           ((uint32_t)0x00004000U)         /* !< Common line */
/* LCD_LCDCSSEL3[LCDCSS63] Bits */
#define LCD_LCDCSSEL3_LCDCSS63_OFS               (15)                            /* !< LCDCSS63 Offset */
#define LCD_LCDCSSEL3_LCDCSS63_MASK              ((uint32_t)0x00008000U)         /* !< Selects pin L63 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL3_LCDCSS63_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL3_LCDCSS63_SEL_COM           ((uint32_t)0x00008000U)         /* !< Common line */

