TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_lcd.h
/* LCD_LCDBM Bits */
/* LCD_LCDBM[MBIT0] Bits */
#define LCD_LCDBM_MBIT0_OFS                      (0)                             /* !< MBIT0 Offset */
#define LCD_LCDBM_MBIT0_MASK                     ((uint8_t)0x00000001U)          /* !< If LCD L[2*index] is selected as
                                                                                    segment line (LCDCSS[2*index] = 0b)
                                                                                    and LCD mux rate is static, 2-, 3- or
                                                                                    4-mux (000b <= LCDMXx <= 011b) 0b =
                                                                                    LCD segment off 1b = LCD segment on
                                                                                    If LCD pin L[2*index] is selected as
                                                                                    common line (LCDCSS[2*index] = 1b):
                                                                                    0b = Pin L[2*index] not used as COM0
                                                                                    1b = Pin L[2*index] is used as COM0
                                                                                    If LCD pin L(index) is selected as
                                                                                    segment line (LCDCSS(index) = 0b) and
                                                                                    LCD mux rate is 5-, 6-, 7- or 8-mux
                                                                                    (LCDMXx >= 100b): 0b = LCD segment
                                                                                    off 1b = LCD segment on If LCD pin
                                                                                    L(index) is selected as common line
                                                                                    (LCDCSS(index) = 1b): 0b = Pin
                                                                                    L(index) not used as COM0 1b = Pin
                                                                                    L(index) is used as COM0 */
#define LCD_LCDBM_MBIT0_OFF                      ((uint8_t)0x00000000U)          /* !< LCD segment/common off */
#define LCD_LCDBM_MBIT0_ON                       ((uint8_t)0x00000001U)          /* !< LCD segment/common on */
/* LCD_LCDBM[MBIT1] Bits */
#define LCD_LCDBM_MBIT1_OFS                      (1)                             /* !< MBIT1 Offset */
#define LCD_LCDBM_MBIT1_MASK                     ((uint8_t)0x00000002U)          /* !< If LCD pin L[2*index] is selected
                                                                                    as segment line (LCDCSS[2*index] =
                                                                                    0b) and LCD mux rate is 2-, 3- or
                                                                                    4-mux (001b <= LCDMXx <= 011b): 0b =
                                                                                    LCD segment off 1b = LCD segment on
                                                                                    If LCD pin L[2*index] is selected as
                                                                                    common line (LCDCSS[2*index] = 1b):
                                                                                    0b = Pin L[2*index] not used as COM1
                                                                                    1b = Pin L[2*index] is used as COM1
                                                                                    If LCD pin L(index) is selected as
                                                                                    segment line (LCDCSS(index) = 0b) and
                                                                                    LCD mux rate is 5-, 6-, 7- or 8-mux
                                                                                    (LCDMXx >= 100b): 0b = LCD segment
                                                                                    off 1b = LCD segment on If LCD pin
                                                                                    L(index) is selected as common line
                                                                                    (LCDCSS(index) = 1b): 0b = Pin
                                                                                    L(index) not used as COM1 1b = Pin
                                                                                    L(index) is used as COM1 */
#define LCD_LCDBM_MBIT1_OFF                      ((uint8_t)0x00000000U)          /* !< LCD segment/common off */
#define LCD_LCDBM_MBIT1_ON                       ((uint8_t)0x00000002U)          /* !< LCD segment/common on */
/* LCD_LCDBM[MBIT2] Bits */
#define LCD_LCDBM_MBIT2_OFS                      (2)                             /* !< MBIT2 Offset */
#define LCD_LCDBM_MBIT2_MASK                     ((uint8_t)0x00000004U)          /* !< If LCD pin L[2*index] is selected
                                                                                    as segment line (LCDCSS[2*index] =
                                                                                    0b) and LCD mux rate is 3- or 4-mux
                                                                                    (010b <= LCDMXx <= 011b): 0b = LCD
                                                                                    segment off 1b = LCD segment on If
                                                                                    LCD pin L[2*index] is selected as
                                                                                    common line (LCDCSS[2*index] = 1b):
                                                                                    0b = Pin L[2*index] not used as COM2
                                                                                    1b = Pin L[2*index] is used as COM2
                                                                                    If LCD pin L(index) is selected as
                                                                                    segment line (LCDCSS(index) = 0b) and
                                                                                    LCD mux rate is 5-, 6-, 7- or 8-mux
                                                                                    (LCDMXx >= 100b): 0b = LCD segment
                                                                                    off 1b = LCD segment on If LCD pin
                                                                                    L(index) is selected as common line
                                                                                    (LCDCSS(index) = 1b): 0b = Pin
                                                                                    L[index-1] not used as COM2 1b = Pin
                                                                                    L[index-1] is used as COM2 */
#define LCD_LCDBM_MBIT2_OFF                      ((uint8_t)0x00000000U)          /* !< LCD segment/common off */
#define LCD_LCDBM_MBIT2_ON                       ((uint8_t)0x00000004U)          /* !< LCD segment/common on */
/* LCD_LCDBM[MBIT3] Bits */
#define LCD_LCDBM_MBIT3_OFS                      (3)                             /* !< MBIT3 Offset */
#define LCD_LCDBM_MBIT3_MASK                     ((uint8_t)0x00000008U)          /* !< If LCD pin L(index) is selected as
                                                                                    segment line (LCDCSS(index) = 0b) and
                                                                                    LCD mux rate is 4-mux (LCDMXx=011b):
                                                                                    0b = LCD segment off 1b = LCD segment
                                                                                    on If LCD pin L[2*index] is selected
                                                                                    as common line (LCDCSS[2*index] =
                                                                                    1b): 0b = Pin L[2*index] not used as
                                                                                    COM3 1b = Pin L[2*index] is used as
                                                                                    COM3 If LCD pin L(index) is selected
                                                                                    as segment line (LCDCSS(index) = 0b)
                                                                                    and LCD mux rate is 5-, 6-, 7- or
                                                                                    8-mux (LCDMXx >= 100b): 0b = LCD
                                                                                    segment off 1b = LCD segment on If
                                                                                    LCD pin L(index) is selected as
                                                                                    common line (LCDCSS(index) = 1b): 0b
                                                                                    = Pin L(index) not used as COM3 1b =
                                                                                    Pin L(index) is used as COM3 */
#define LCD_LCDBM_MBIT3_OFF                      ((uint8_t)0x00000000U)          /* !< LCD segment/common off */
#define LCD_LCDBM_MBIT3_ON                       ((uint8_t)0x00000008U)          /* !< LCD segment/common on */
/* LCD_LCDBM[MBIT4] Bits */
#define LCD_LCDBM_MBIT4_OFS                      (4)                             /* !< MBIT4 Offset */
#define LCD_LCDBM_MBIT4_MASK                     ((uint8_t)0x00000010U)          /* !< If LCD pin L[2*index+1] is selected
                                                                                    as segment line (LCDCSS[2*index+1] =
                                                                                    0b) and LCD mux rate is static, 2-,
                                                                                    3- or 4-mux (000b <= LCDMXx <= 011b)
                                                                                    0b = LCD segment off 1b = LCD segment
                                                                                    on If LCD pin L[2*index+1] is
                                                                                    selected as common line
                                                                                    (LCDCSS[2*index+1] = 1b): 0b = Pin
                                                                                    L[2*ndex+1] not used as COM0 1b = Pin
                                                                                    L[2*ndex+1] is used as COM0 */
#define LCD_LCDBM_MBIT4_OFF                      ((uint8_t)0x00000000U)          /* !< LCD segment/common off */
#define LCD_LCDBM_MBIT4_ON                       ((uint8_t)0x00000010U)          /* !< LCD segment/common on */
/* LCD_LCDBM[MBIT5] Bits */
#define LCD_LCDBM_MBIT5_OFS                      (5)                             /* !< MBIT5 Offset */
#define LCD_LCDBM_MBIT5_MASK                     ((uint8_t)0x00000020U)          /* !< If LCD pin L[2*index+1] is selected
                                                                                    as segment line (LCDCSS[2*index+1] =
                                                                                    0b) and LCD mux rate is 2-, 3- or
                                                                                    4-mux (001b <= LCDMXx <= 011b): 0b =
                                                                                    LCD segment off 1b = LCD segment on
                                                                                    If LCD pin L[2*index+1] is selected
                                                                                    as common line (LCDCSS[2*index+1] =
                                                                                    1b): 0b = Pin L[2*index+1] not used
                                                                                    as COM1 1b = Pin L[2*index+1] is used
                                                                                    as COM1 If LCD pin L(index) is
                                                                                    selected as segment line
                                                                                    (LCDCSS(index) = 0b) and LCD mux rate
                                                                                    is 6-, 7- or 8-mux (LCDMXx >= 101b):
                                                                                    0b = LCD segment off 1b = LCD segment
                                                                                    on If LCD pin L(index) is selected as
                                                                                    common line (LCDCSS(index) = 1b): 0b
                                                                                    = Pin L(index) not used as COM5 1b =
                                                                                    Pin L(index) is used as COM5 */
#define LCD_LCDBM_MBIT5_OFF                      ((uint8_t)0x00000000U)          /* !< LCD segment/common off */
#define LCD_LCDBM_MBIT5_ON                       ((uint8_t)0x00000020U)          /* !< LCD segment/common on */
/* LCD_LCDBM[MBIT6] Bits */
#define LCD_LCDBM_MBIT6_OFS                      (6)                             /* !< MBIT6 Offset */
#define LCD_LCDBM_MBIT6_MASK                     ((uint8_t)0x00000040U)          /* !< If LCD pin L[2*index+1] is selected
                                                                                    as segment line (LCDCSS[2*index+1] =
                                                                                    0b) and LCD mux rate is 3- or 4-mux
                                                                                    (010b <= LCDMXx <= 011b): 0b = LCD
                                                                                    segment off 1b = LCD segment on If
                                                                                    LCD pin L[2*index+1] is selected as
                                                                                    common line (LCDCSS[2*index+1] = 1b):
                                                                                    0b = Pin L[2*index+1] not used as
                                                                                    COM2 1b = Pin L[2*index+1] is used as
                                                                                    COM2 If LCD pin L(index) is selected
                                                                                    as segment line (LCDCSS(index) = 0b)
                                                                                    and LCD mux rate is 7- or 8-mux
                                                                                    (LCDMXx >= 110b): 0b = LCD segment
                                                                                    off 1b = LCD segment on If LCD pin
                                                                                    L(index) is selected as common line
                                                                                    (LCDCSS(index) = 1b): 0b = Pin
                                                                                    L(index) not used as COM6 1b = Pin
                                                                                    L(index) is used as COM6 */
#define LCD_LCDBM_MBIT6_OFF                      ((uint8_t)0x00000000U)          /* !< LCD segment/common off */
#define LCD_LCDBM_MBIT6_ON                       ((uint8_t)0x00000040U)          /* !< LCD segment/common on */
/* LCD_LCDBM[MBIT7] Bits */
#define LCD_LCDBM_MBIT7_OFS                      (7)                             /* !< MBIT7 Offset */
#define LCD_LCDBM_MBIT7_MASK                     ((uint8_t)0x00000080U)          /* !< If LCD pin L[2*index+1] is selected
                                                                                    as segment line (LCDCSS[2*index+1] =
                                                                                    0b) and LCD mux rate is 4-mux
                                                                                    (LCDMXx=011b): 0b = LCD segment off
                                                                                    1b = LCD segment on If LCD pin
                                                                                    L[2*index+1] is selected as common
                                                                                    line (LCDCSS[2*index+1] = 1b): 0b =
                                                                                    Pin L[2*index+1] not used as COM3 1b
                                                                                    = Pin L[2*index+1] is used as COM3 If
                                                                                    LCD pin L(index) is selected as
                                                                                    segment line (LCDCSS(index) = 0b) and
                                                                                    LCD mux rate is 8-mux (LCDMXx =
                                                                                    111b): 0b = LCD segment off 1b = LCD
                                                                                    segment on If LCD pin L(index) is
                                                                                    selected as common line
                                                                                    (LCDCSS(index) = 1b): 0b = Pin
                                                                                    L(index) not used as COM7 1b = Pin
                                                                                    L(index) is used as COM7 */
#define LCD_LCDBM_MBIT7_OFF                      ((uint8_t)0x00000000U)          /* !< LCD segment/common off */
#define LCD_LCDBM_MBIT7_ON                       ((uint8_t)0x00000080U)          /* !< LCD segment/common on */

/* LCD_LCDVREFCFG Bits */
/* LCD_LCDVREFCFG[ONTIME] Bits */
#define LCD_LCDVREFCFG_ONTIME_OFS                (0)                             /* !< ONTIME Offset */
#define LCD_LCDVREFCFG_ONTIME_MASK               ((uint32_t)0x00000003U)         /* !< Configures the ontime of the VREF. */
#define LCD_LCDVREFCFG_ONTIME_ONTIME16           ((uint32_t)0x00000000U)         /* !< 16 CLKCP cycles of ontime */
#define LCD_LCDVREFCFG_ONTIME_ONTIME32           ((uint32_t)0x00000001U)         /* !< 32 CLKCP cycles of ontime */
#define LCD_LCDVREFCFG_ONTIME_ONTIME128          ((uint32_t)0x00000002U)         /* !< 128 CLKCP cycles of ontime */
#define LCD_LCDVREFCFG_ONTIME_ONTIME256          ((uint32_t)0x00000003U)         /* !< 256 CLKCP cycles of ontime */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_lcd__include */
